title: Suspicious PowerShell Execution
id: suspicious-powershell-execution
status: experimental
description: Detects suspicious PowerShell execution with stealth or abuse indicators
author: Wael Saad Kamal
date: 2026/03/22

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith: '\powershell.exe'
  keywords:
    CommandLine|contains:
      - '-nop'
      - 'hidden'
      - 'IEX'
      - 'enc'
      - 'DownloadString'
  condition: selection and keywords

falsepositives:
  - Administrative PowerShell activity
  - Internal automation scripts
  - Security testing in lab

level: high

tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1027
  - attack.t1105
