title: Suspicious PowerShell Execution
id: 8f9f6d6c-1111-4444-9999-powershell
status: experimental

description: Detect suspicious PowerShell execution patterns

author: Wael SK

logsource:
  product: windows
  category: process_creation

detection:
  selection:
    Image|endswith:
      - '\powershell.exe'

    CommandLine|contains:
      - '-nop'
      - '-enc'
      - 'DownloadString'
      - 'IEX'
      - 'Net.WebClient'

  condition: selection

fields:
  - CommandLine
  - ParentImage
  - User

level: high

tags:
  - attack.execution
  - attack.t1059.001
  - attack.t1027
